#include <iostream>
#include <cmath>

using namespace std;
//Liza Ruda FIT 1-4 Варіант 27

//Рахує значення виразу та виводить його
int main()
{
	setlocale(0, ".1251");
	double y, k, x;
	x = 0;
	k = 12;
	cout << "Введіть значення y =";
	//При будь-якому значенні у вираз під коренем в чисельнику буде додатнім
	//В знаменнику вираз не може = 0, а він при будь-якому значенні у не дорівнює 0
	//Отже область визнавення = усі числа
	cin >> y;

	x = (sqrt(pow(sin(y), 2) + 6.835)) / (log(y + k) + 3 * pow(y, 2));

	cout << "Результат х = " << x << endl;
	return 0;
}

	
